from config import OWNER_USERNAME, SUPPORT_GRP
from nexichat import nexichat
from pyrogram import Client, filters

START = """**
{} ربات چت هوشمند و سریع 💞

➪ پشتیبانی از متن، استیکر، عکس، ویدیو...
➪ چند زبانه برای هر چت /setlang
➪ فعال/غیرفعال کردن ربات با /chatbot
➪ ساخت ربات چت شخصی با /clone
➪ ساخت ربات چت آیدی با /idclone

๏ تعداد کاربران: {}
๏ تعداد چت‌ها: {}
๏ زمان کارکرد: {}

╔═════════════════╗
║ ➻ سازنده ➪ [𝙉𝙄𝙏𝙍𝙊 ✯ 𝙋𝙇𝙐𝙎](https://t.me/Owner_nitroplus)                         
╚═════════════════╝
**"""

HELP_READ = f"""**
برای اطلاعات بیشتر روی دکمه‌های زیر کلیک کنید. اگر با مشکلی مواجه شدید می‌توانید در [گروه پشتیبانی](https://t.me/Poshtibaninetroplusbot) سوال کنید.

همه دستورات با / قابل استفاده هستند:**
"""

TOOLS_DATA_READ = f"""**
๏ دستورات ابزارها:

➻ /start برای شروع کار با ربات و دریافت پیام خوش‌آمدگویی!
──────────────
➻ /help برای دریافت راهنمای کامل دستورات و امکانات
──────────────
➻ /ping برای بررسی زمان پاسخ‌دهی ربات!
──────────────
➻ /speedtest بررسی سرعت سرور
──────────────
➻ /id برای دریافت شناسه کاربری، گروه و پیام
──────────────
➻ /broadcast برای ارسال پیام به همه چت‌ها!\nمثال: `/broadcast -user -pin سلام دوستان`
──────────────
➻ /shayri دریافت شعر تصادفی عاشقانه
──────────────
➻ /link (شناسه گروه) برای دریافت لینک گروه
➻ /givelink برای دریافت لینک همین گروه (در گروه بنویسید)
──────────────
➻ /repo برای دریافت سورس کد ربات!
──────────────
๏ ساخته شده توسط ➪ [𝙣𝙞𝙩𝙧𝙤 ✯ 𝙥𝙡𝙪𝙨](https://t.me/Owner_nitroplus) 💞**
"""

CHATBOT_READ = f"""**
๏ دستورات ربات چت:

➻ /chatbot - گزینه‌های فعال/غیرفعال کردن ربات
──────────────
➻ /ask - پرسیدن هر سوالی از ChatGPT
──────────────
➻ /lang, /language, /setlang - منوی انتخاب زبان چت
──────────────
➻ /resetlang, /nolang - بازنشانی زبان ربات به حالت ترکیبی
──────────────
➻ /chatlang - مشاهده زبان فعلی چت
──────────────
➻ /status - بررسی وضعیت فعال بودن ربات
──────────────
➻ /stats - دریافت آمار ربات
──────────────
➻ /clone [توکن ربات] - ساخت نسخه مشابه از ربات
──────────────
➻ /idclone [نشست پایروگرام] - ساخت ربات چت آیدی
──────────────
📡 ساخته شده توسط ➪ [𝙉𝙄𝙏𝙍𝙊 ✯ 𝙋𝙇𝙐𝙎](https://t.me/Owner_nitroplus) 💞**
"""

SOURCE_READ = f"""**سلام، سورس کد [{nexichat.name}](https://t.me/{nexichat.username}) در زیر آمده است.**
**لطفاً با سازنده تماس بگیرید ✯**
**──────────────────**
**اینجا [سازنده](https://t.me/Owner_nitroplus) است**
**──────────────────**
**اگر با مشکلی مواجه شدید با [گروه پشتیبانی](https://t.me/{SUPPORT_GRP}) تماس بگیرید.
<b>||📡 ساخته شده توسط ➪ [SIDHI ✯ MUSIC](https://t.me/ll_SARKAR_OWNER_ll) 💞**||</b>"""

ADMIN_READ = "به زودی"

ABOUT_READ = f"""
**➻ [{nexichat.name}](https://t.me/{nexichat.username}) یک ربات چت مبتنی بر هوش مصنوعی است.**
**➻ [{nexichat.name}](https://t.me/{nexichat.username}) به طور خودکار به کاربران پاسخ می‌دهد.**
**➻ به شما در فعال‌سازی گروه‌هایتان کمک می‌کند.**
**➻ نوشته شده با [پایتون](https://www.python.org) و [مونگو-دی‌بی](https://www.mongodb.com) به عنوان پایگاه داده**
**──────────────**
**➻ برای دریافت راهنما و اطلاعات اولیه درباره [{nexichat.name}](https://t.me/{nexichat.username}) روی دکمه‌های زیر کلیک کنید**
"""
