from config import OWNER_USERNAME, SUPPORT_GRP
from nexichat import nexichat
from pyrogram import Client, filters

START = """**
🤖 این یک ربات چت فوق سریع است 🚀

📁 پشتیبانی از متن، استیکر، عکس، ویدیو...
🌍 چند زبانه برای هر چت با دستور /setlang
⚙️ فعال/غیرفعال کردن ربات با /chatbot [on/off]
🔄 کلون کردن ربات با دستور /idclone

⏱️ زمان فعالیت » {}

╔═════════════════╗
║ ➻ سورس کد من ➪ [کلیک کنید](https://t.me/bialnja) 🎁                
╚═════════════════╝

➲ برای استفاده از امکانات، مرا به گروه خود اضافه کنید.
**"""

HELP_READ = """**
**"""

TOOLS_DATA_READ = """**
๏ دستورات ابزارها:

➻ /start برای شروع کار با ربات و دریافت پیام خوش‌آمدگویی!
──────────────
➻ /help برای دریافت اطلاعات کامل درباره تمام دستورات و امکانات
──────────────
➻ /ping برای بررسی زمان پاسخ‌دهی ربات!
──────────────
➻ /id برای دریافت شناسه کاربری، گروه و پیام در یک پیام
──────────────
➻ .broadcast برای ارسال پیام به همه چت‌ها بر اساس پرچم‌های مشخص شده!
مثال: `/broadcast -user -pin سلام دوستان`
──────────────
➻ /shayri دریافت شعر تصادفی عاشقانه
──────────────
➻ .tagall [ پیام ] برای تگ کردن همه اعضای گروه
──────────────
➻ /link (شناسه گروه) برای دریافت لینک گروه
──────────────
➻ /givelink برای دریافت لینک گروه فعلی (در گروه استفاده شود)
──────────────
➻ /repo برای دریافت سورس کد ربات!
──────────────
➲ برای استفاده از امکانات، مرا به گروه خود اضافه کنید.**
"""

CHATBOT_READ = """**
๏ دستورات ربات چت:

➻ /chatbot - نمایش گزینه‌های فعال/غیرفعال کردن ربات چت
──────────────
➻ /ask - پرسیدن هر سوالی از ChatGPT
──────────────
➻ /lang, /setlang - نمایش منوی انتخاب زبان چت
──────────────
➻ /resetlang, /nolang - بازنشانی زبان ربات به حالت ترکیبی
──────────────
➻ /chatlang - مشاهده زبان فعلی چت
──────────────
➻ /status - بررسی وضعیت فعال بودن ربات چت
──────────────
➻ /stats - دریافت آمار ربات
──────────────
➻ .idclone [ نشست پایروگرام ] - ساخت ربات چت شخصی
──────────────
➲ برای استفاده از امکانات، مرا به گروه خود اضافه کنید.
**"""

SOURCE_READ = f"""**سلام، سورس کد [{nexichat.name}](https://t.me/{nexichat.username}) در زیر آمده است.**
**لطفاً با سازنده تماس بگیرید ✯**
**──────────────────**
**سازنده: [کلیک کنید](https://t.me/bialnja)**
**──────────────────**
**در صورت بروز مشکل با [گروه پشتیبانی](https://t.me/{SUPPORT_GRP}) تماس بگیرید.
<b>||📡 ساخته شده توسط ➪ [سیدهی ✯ موزیک](https://t.me/bialnja) 💞**||</b>"""

ADMIN_READ = "به زودی"

ABOUT_READ = f"""
**➻ [{nexichat.name}](https://t.me/{nexichat.username}) یک ربات چت مبتنی بر هوش مصنوعی است.**
**➻ [{nexichat.name}](https://t.me/{nexichat.username}) به صورت خودکار به کاربران پاسخ می‌دهد.**
**➻ به شما در مدیریت گروه‌هایتان کمک می‌کند.**
**➻ نوشته شده با [پایتون](https://www.python.org) و [مونگو-دی‌بی](https://www.mongodb.com) به عنوان پایگاه داده**
**──────────────**
**➻ برای دریافت راهنمایی و اطلاعات بیشتر درباره [{nexichat.name}](https://t.me/{nexichat.username}) روی دکمه‌های زیر کلیک کنید**
"""
